{
  "navigation": {
    "home": "Главная",
    "about": "Обо мне",
    "works": "Работы"
  },
  "intro": {
    "title": {
      "text": "Привет, я",
      "name": "Артём Якушевский"
    },
    "subtitle": "Web & Front-end разработчик"
  },
  "contactButton": "Связаться",
  "about": {
    "briefly": {
      "title": "Кратко обо мне",
      "text": "Программированием я начал интересоваться ещё в 8 классе и долгое время не мог определиться с направлением, поэтому на хорошем базовом уровне я владею несколькими языками программирования, в том числе: C#, Python и JS. В итоге я выбрал Front-end разработку в качестве направления своего развития и достаточно глубоко изучил HTML, CSS и JavaScript."
    },
    "education": {
      "title": "Образование",
      "text": "На данный момент я учусь в НИУ ВШЭ на «Программнай инженерии», год окончания - 2025\nУчусь на бюджете, благодаря 288 баллам за ЕГЭ:\nМатематика - 99\nИнформатика - 96\nРусский язык- 93"
    }
  },
  "skills": {
    "title": "Что я умею?",
    "layout": {
      "title": "Вёрстка",
      "text": "Очень уверенно чувствую себя в HTML и CSS. Умею верстать, используя flex и grid. В качестве препроцессора обычно использую SASS в синтаксисе SCSS. Понимаю, что такое методология БЭМ"
    },
    "javaScript": {
      "title": "JavaScript",
      "text": "Понимаю, как работает движок JS, что такое микро и макро таски, как работает асинхронность и промисы и многое другое, текстом в пару строк тут не обойтись"
    },
    "typeScript": {
      "title": "TypeScript",
      "text": "Хотя на стандартном JS писать и быстрее, строгая типизация позволяет заметить многие ошибки ещё на этапе написания кода. Поэтому я очень часто пишу именно на TypeScript"
    },
    "react": {
      "title": "React",
      "text": "Пишу на функциональных компонентах и хуках. Умею использовать такие библиотеки, как Redux, Axios, react router dom, react transition group и другие"
    },
    "nodeJS": {
      "title": "NodeJS",
      "text": "В своих pet-проектах back-end я пишу с помощью Node. Также, конечно, умею пользоваться пакетными менеджерами npm и yarn"
    },
    "git": {
      "title": "Git",
      "text": "Умею пользоваться GitHub и системой контроля версий Git как в консоли, так и внутри своего IDE"
    },
    "oop": {
      "title": "ООП и ФП",
      "text": "Понимаю суть и принципы объектно-ориентированного и функционального программирования, свободно читаю и пишу код в обоих этих парадигмах"
    },
    "algorithms": {
      "title": "Алгоритмы",
      "text": "Благодаря участию во многих олимпиадах и решению задач на сайтах acmp и codesignal, я научился достаточно хорошо решать алгоритмические задачи и вычислять эффективность алгоритмов"
    },
    "testing": {
      "title": "Unit тесты",
      "text": "Написал очень много unit тестов на языке C#. Понимаю, что это такое и зачем оно нужно. Также знаю, как устроен анализ покрытия кода тестами"
    },
    "sql": {
      "title": "SQL",
      "text": "Понимаю, как устроены базы данных и умею писать запросы к ним. Имею опыт работы с SQLite, MySQL, PostgreSQL"
    },
    "python": {
      "title": "Python",
      "text": "До того, как я погрузился в web, долгое время я писал именно на питоне. Помимо прочего, у меня есть опыт использования следующих библиотек: tkinter, typing, sqlite3, webbrowser, selenium, bs4, requests, pandas"
    },
    "dotNet": {
      "title": ".NET",
      "text": "Основной учебный язык в Высшей школе экономики - это C#, поэтому уметь уверенно с ним обращаться я просто обязан"
    }
  },
  "site": {
    "title": "Как сделан этот сайт"
  },
  "works": {
    "title": "Другие работы",
    "gitHub": "Ищите больше моих проектов на GitHub",
    "codeSignal": "Посмотрите мой профиль Codesignal"
  },
  "footer": {
    "name": "Якушевский Артём",
    "phone": "+7 (919) 708-89-72"
  }
}